Updated workflow
